    #include <iostream> 
    using namespace std; 

    int main() 
    {
        int a , b , x , t , k;

        cout << "Введите сторону A: ";
        cin >> a ;
        cout << "Введите сторону B: ";
        cin >> b ;
        cout << "данные вашего прямоугольника: "<< a << "-" << b <<endl;
        cout << "Введите стороны треугольника \n введите сторону t: ";
        cin >> t;
        cout << "введите сторону k: ";
        cin >> k;
        cout << "Введите сторону x: ";
        cin >> x ;

        
        
            if 
            ( 
            (a > t) && (a > k) && (a > x) &&
            (b > t) && (b > k) && (b > x)  
            )
            {
                cout << "все в порядке 👍 \n";
            }
            
            if ( (t == k) && (t == x) && (x == k) )
            {
                cout << "Ответ: A \n";
            }
    
            else if ( ( t != k ) || (k != x) )
            {
                cout << "Ответ: Б \n";
            }
            else if (a and b < t and k and x)        
            {
                cout << "Ваш треугольник вылез за грани прямоугольника \n";
            }
            
            
            return 0;
    }